[
	{
		"id": 1,
		"title": "Grad Show Project",
		"blurb": "This project was developed at North Metropolitan TAFE. A website built with WordPress, SCSS, and JavaScript, showcasing the work of graduating students in Semester 1 of 2023.",
		"description": [
			"As a member of a collaborative team, I was involved in designing and developing a WordPress website to showcase the work of graduating students from North Metropolitan TAFE in Semester 1 of 2023. The Grad Show website aimed to provide a platform for students to showcase their work and connect with potential employers and industry professionals.",
			"Using Figma, we designed a visually appealing and user-friendly interface that highlighted the students' diverse talents and skills. We also utilized WordPress to provide a flexible and scalable platform for managing and updating the website's content."
		],
		"imageId": 0,
		"imageAlt": "Screenshot of Grad Show Project homepage.",
		"siteLink": "https://2023.gradshow.screencraft.net.au/",
		"repoLink": "https://github.com/00Wyatt/gradshow"
	},
	{
		"id": 2,
		"title": "Coffee Tracker",
		"blurb": "An app for tracking coffees and caffeine levels, built with React, TailwindCSS, and Vite. Authentication and user data storage with Firebase.",
		"description": [
			"A modern web app designed to help users monitor their coffee intake and caffeine levels throughout the day. Built with React and styled using TailwindCSS, the app offers a clean and user-friendly interface for logging coffee consumption. Users can record details such as the cost of each coffee and the time it was consumed, enabling detailed tracking of their caffeine habits.",
			"Firebase powers the app's authentication system and securely stores user accounts and data, ensuring a personalized experience. Bundled with Vite for fast performance, the app delivers a responsive and efficient way to manage coffee consumption and make informed decisions about caffeine intake."
		],

		"imageId": 1,
		"imageAlt": "Screenshot of Brick-by-Brick homepage.",
		"siteLink": "https://coffee-tracker-app.netlify.app/",
		"repoLink": "https://github.com/00Wyatt/coffee-tracker"
	},
	{
		"id": 3,
		"title": "Pokédex",
		"blurb": "A responsive Pokédex app built with React, styled using TailwindCSS, and bundled with Vite. The app fetches data from the Pokémon API.",
		"description": [
			"This project showcases modern front-end development practices and API integration, using React for dynamic UI updates and TailwindCSS for efficient styling. Also included is theme toggling from light to dark, and data caching using local storage to minimise API requests.",
			"The user can browse the list of Pokémon or search for one by name or Pokédex number. The page displays information about the selected Pokémon including their weight, height, abilities, stats, and a full list of the moves they can learn."
		],
		"imageId": 2,
		"imageAlt": "Screenshot of the Pokédex' homepage.",
		"siteLink": "https://pokedex-ii.netlify.app/",
		"repoLink": "https://github.com/00Wyatt/pokedex"
	}
]
