[
	{
		"id": 1,
		"title": "Dashboard",
		"blurb": "A modern and responsive dashboard built with React, TypeScript, Material UI, and Vite, displaying key metrics and insights in a user-friendly layout.",
		"description": [
			"This dashboard is a responsive web application designed to showcase key metrics and insights in a clean and modern interface. Built with React, TypeScript, and Material UI, it highlights my ability to create intuitive, visually appealing, and functional user experiences.",
			"The current version features an overview page with general stats, and additional pages will be added in the future to expand its functionality. This project demonstrates my skills in front end development, component-based design, and creating responsive layouts optimised for both desktop and mobile devices.",
			"Read more about the process on my GitHub."
		],
		"imageId": 0,
		"imageAlt": "Screenshot of the dashboard's main page.",
		"siteLink": "https://dashboard-wc.netlify.app/",
		"repoLink": "https://github.com/00Wyatt/dashboard"
	},
	{
		"id": 2,
		"title": "Coffee Tracker",
		"blurb": "An app for tracking coffees and caffeine levels, built with React, TailwindCSS, and bundled with Vite. Authentication and user data storage with Firebase.",
		"description": [
			"A modern web app designed to help users monitor their coffee intake and caffeine levels throughout the day. Built with React and styled using TailwindCSS, the app offers a clean and user-friendly interface for logging coffee consumption. Users can record details such as the cost of each coffee and the time it was consumed, enabling detailed tracking of their caffeine habits.",
			"Firebase powers the app's authentication system and securely stores user accounts and data, ensuring a personalized experience. Bundled with Vite for fast performance, the app delivers a responsive and efficient way to manage coffee consumption and make informed decisions about caffeine intake."
		],

		"imageId": 1,
		"imageAlt": "Screenshot of Coffee Tracker homepage.",
		"siteLink": "https://coffee-tracker-app.netlify.app/",
		"repoLink": "https://github.com/00Wyatt/coffee-tracker"
	},
	{
		"id": 3,
		"title": "Grad Show Project",
		"blurb": "This project was developed at North Metropolitan TAFE. A website built with WordPress, SCSS, and JavaScript, showcasing the work of graduating students in Semester 1 of 2023.",
		"description": [
			"As a member of a collaborative team, I was involved in designing and developing a WordPress website to showcase the work of graduating students from North Metropolitan TAFE in Semester 1 of 2023. The Grad Show website aimed to provide a platform for students to showcase their work and connect with potential employers and industry professionals.",
			"Using Figma, we designed a visually appealing and user-friendly interface that highlighted the students' diverse talents and skills. We also utilized WordPress to provide a flexible and scalable platform for managing and updating the website's content."
		],
		"imageId": 2,
		"imageAlt": "Screenshot of Grad Show Project homepage.",
		"siteLink": "https://2023.gradshow.screencraft.net.au/",
		"repoLink": "https://github.com/00Wyatt/gradshow"
	}
]
